In [1]:
import numpy as np
import pandas as pd

ðŸŸ¢ SECTION A â€” Basic Data Handling (Foundation)

Q1 Load a CSV and:

Show total rows and columns, 
Show memory usage per column, 
Show data types

In [2]:
# Read File:
df = pd.read_csv("test.csv")

# Show TOtal Columns and rows:
print(df.shape)

(418, 11)

In [3]:
# show memory Usage per column:
print(df.memory_usage(deep=True)/1024)

Index           0.128906
PassengerId     3.265625
Pclass          3.265625
Name           31.220703
Sex            21.931641
Age             3.265625
SibSp           3.265625
Parch           3.265625
Ticket         22.808594
Fare            3.265625
Cabin          14.935547
Embarked       20.410156
dtype: float64

In [4]:
# Show Data types:
print(df.dtypes)

PassengerId      int64
Pclass           int64
Name               str
Sex                str
Age            float64
SibSp            int64
Parch            int64
Ticket             str
Fare           float64
Cabin              str
Embarked           str
dtype: object

In [5]:
df.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

Q2 Find:

Total missing values per column, 
Percentage missing, 
Column with highest null ratio

In [6]:
# Total Missing Walue per Column:
print(df.isnull().sum())

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [7]:
# Percentage Missing Value:
# null_p = (df.isnull().mean()*100).round(2) #round for how many numbers after (.) 
null_per = (df.isnull().sum()/ len(df) * 100).round(2)
print(null_per)

PassengerId     0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            20.57
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.24
Cabin          78.23
Embarked        0.00
dtype: float64

In [8]:
# Column with highest null ratio
# find Null Ration:
null_ratio = (df.isnull().mean()).round(2)
print(null_ratio)

PassengerId    0.00
Pclass         0.00
Name           0.00
Sex            0.00
Age            0.21
SibSp          0.00
Parch          0.00
Ticket         0.00
Fare           0.00
Cabin          0.78
Embarked       0.00
dtype: float64

In [9]:
# finding Max Null Ratio:
Max_null_ratio = null_ratio.idxmax()
print(Max_null_ratio, max(null_ratio))

Cabin 0.78

Drop columns with >40% missing, Fill numeric nulls using median, Fill categorical nulls using mode

In [10]:
print(null_per[null_per > 40])
columns_grater_40_per = null_per[null_per>40].index #to find Index/Lable with specific values
print(columns_grater_40_per)

Cabin    78.23
dtype: float64
Index(['Cabin'], dtype='str')

In [11]:
# Drop Columns with >40%:
df = df.drop(columns=columns_grater_40_per)

In [12]:
# Fill numeric nulls using median

print(df.isnull().sum())
print((df.isnull().sum()/len(df) * 100).round(2))

PassengerId     0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
dtype: int64
PassengerId     0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            20.57
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.24
Embarked        0.00
dtype: float64

In [13]:
numeric_cols = df.select_dtypes(include="number")
# df[numeric_cols.columns] = numeric_cols.fillna(numeric_cols.mean())
df.fillna(df.mean(numeric_only=True), inplace=True)
df.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

Q3 Select:

All passengers older than 30, Female passengers in 1st class, Passengers who paid fare above average

In [14]:
# All passengers older than 30:

pasanger_grater30 = df[df['Age']> 30]
pasanger_grater30.count()
pd.DataFrame(pasanger_grater30)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.50000,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,240276,9.6875,Q
10,902,3,"Ilieff, Mr. Ylio",male,30.27259,0,0,349220,7.8958,S
11,903,1,"Jones, Mr. Charles Cresson",male,46.00000,0,0,694,26.0000,S
...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,30.27259,0,0,A.5. 3236,8.0500,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,3,"Ware, Mr. Frederick",male,30.27259,0,0,359309,8.0500,S
417,1309,3,"Peter, Master. Michael J",male,30.27259,1,1,2668,22.3583,C

In [15]:
# Female passengers in 1st class:

female_in_1st_class = df[(df["Sex"] == "female") & (df["Pclass"] == 1)]
print(len(female_in_1st_class))
female_in_1st_class = female_in_1st_class.reset_index(drop=True)
# pd.DataFrame(female_in_1st_class)

50

In [16]:
# Passengers who paid fare above average:
Passengers_Fare_above_avg = df[df["Fare"] > df["Fare"].mean()]
Passengers_Fare_above_avg = Passengers_Fare_above_avg.reset_index() #Reset Index
pd.DataFrame(Passengers_Fare_above_avg)

,index,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,S
1,14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,S
2,20,912,1,"Rothschild, Mr. Martin",male,55.0,1,0,PC 17603,59.4000,C
3,23,915,1,"Williams, Mr. Richard Norris II",male,21.0,0,1,PC 17597,61.3792,C
4,24,916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,C
...,...,...,...,...,...,...,...,...,...,...,...
92,402,1294,1,"Gibson, Miss. Dorothy Winifred",female,22.0,0,1,112378,59.4000,C
93,403,1295,1,"Carrau, Mr. Jose Pedro",male,17.0,0,0,113059,47.1000,S
94,407,1299,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C
95,411,1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,Q
96,414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C

Q4 Create new columns:

FamilySize = SibSp + Parch + 1, IsAlone (1 if FamilySize == 1 else 0)

In [17]:
# FamilySize = SibSp + Parch + 1
df.insert(7,"FamilySize",(df['SibSp']+ df['Parch'] + 1))
pd.DataFrame(df)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,FamilySize,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.50000,0,0,1,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,2,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,1,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.00000,0,0,1,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,30.27259,0,0,1,A.5. 3236,8.0500,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,1,PC 17758,108.9000,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,1,SOTON/O.Q. 3101262,7.2500,S
416,1308,3,"Ware, Mr. Frederick",male,30.27259,0,0,1,359309,8.0500,S
417,1309,3,"Peter, Master. Michael J",male,30.27259,1,1,3,2668,22.3583,C

In [18]:
# IsAlone (1 if FamilySize == 1 else 0)
df.insert(8, "isAlone", (df["FamilySize"] == 1).astype(int))
pd.DataFrame(df)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,FamilySize,isAlone,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.50000,0,0,1,1,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,2,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,1,1,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.00000,0,0,1,1,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3,0,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,30.27259,0,0,1,1,A.5. 3236,8.0500,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,1,1,PC 17758,108.9000,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,1,1,SOTON/O.Q. 3101262,7.2500,S
416,1308,3,"Ware, Mr. Frederick",male,30.27259,0,0,1,1,359309,8.0500,S
417,1309,3,"Peter, Master. Michael J",male,30.27259,1,1,3,0,2668,22.3583,C

Q5 Sort dataset by:

Age ascending, Fare descending, Then return top 10 rows.

In [19]:
# Age ascending:
sort_by_age = df.sort_values(by="Age", ascending=True, ignore_index=True)
pd.DataFrame(sort_by_age.head(11))

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,FamilySize,isAlone,Ticket,Fare,Embarked
0,1246,3,"Dean, Miss. Elizabeth Gladys Millvina""""",female,0.17,1,2,4,0,C.A. 2315,20.5750,S
1,1093,3,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,0,2,3,0,347080,14.4000,S
2,1173,3,"Peacock, Master. Alfred Edward",male,0.75,1,1,3,0,SOTON/O.Q. 3101315,13.7750,S
3,1199,3,"Aks, Master. Philip Frank",male,0.83,0,1,2,0,392091,9.3500,S
4,1142,2,"West, Miss. Barbara J",female,0.92,1,2,4,0,C.A. 34651,27.7500,S
5,1155,3,"Klasen, Miss. Gertrud Emilia",female,1.00,1,1,3,0,350405,12.1833,S
6,1009,3,"Sandstrom, Miss. Beatrice Irene",female,1.00,1,1,3,0,PP 9549,16.7000,S
7,1188,2,"Laroche, Miss. Louise",female,1.00,1,2,4,0,SC/Paris 2123,41.5792,C
8,981,2,"Wells, Master. Ralph Lester",male,2.00,1,1,3,0,29103,23.0000,S
9,1176,3,"Rosblom, Miss. Salli Helena",female,2.00,1,1,3,0,370129,20.2125,S
10,1301,3,"Peacock, Miss. Treasteall",female,3.00,1,1,3,0,SOTON/O.Q. 3101315,13.7750,S

In [20]:
# Fare descending:
sort_by_fare =df.sort_values(by="Fare", ascending=False, ignore_index=True)
pd.DataFrame(sort_by_fare.head(11))

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,FamilySize,isAlone,Ticket,Fare,Embarked
0,1235,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,2,0,PC 17755,512.3292,C
1,945,1,"Fortune, Miss. Ethel Flora",female,28.0,3,2,6,0,19950,263.0000,S
2,961,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,6,0,19950,263.0000,S
3,951,1,"Chaudanson, Miss. Victorine",female,36.0,0,0,1,1,PC 17608,262.3750,C
4,956,1,"Ryerson, Master. John Borie",male,13.0,2,2,5,0,PC 17608,262.3750,C
5,1267,1,"Bowen, Miss. Grace Scott",female,45.0,0,0,1,1,PC 17608,262.3750,C
6,1034,1,"Ryerson, Mr. Arthur Larned",male,61.0,1,3,5,0,PC 17608,262.3750,C
7,916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,5,0,PC 17608,262.3750,C
8,1076,1,"Douglas, Mrs. Frederick Charles (Mary Helene B...",female,27.0,1,1,3,0,PC 17558,247.5208,C
9,1094,1,"Astor, Col. John Jacob",male,47.0,1,0,2,0,PC 17757,227.5250,C
10,1006,1,"Straus, Mrs. Isidor (Rosalie Ida Blun)",female,63.0,1,0,2,0,PC 17483,221.7792,S

SECTION B â€” Intermediate (Where Most Students Fail)

Q6 Group by Pclass:

Average Age, 

Average Fare

Survival Rate

Return a clean summary table.

In [21]:
Pclass_group = df.groupby("Pclass")
age_avg = Pclass_group['Age'].mean()
avg_fare = Pclass_group['Fare'].mean()

pd.DataFrame(age_avg)

              Age
Pclass
1       40.022928
2       28.857881
3       26.090397

In [22]:
pd.DataFrame(avg_fare)

             Fare
Pclass
1       94.280297
2       22.202104
3       12.565951

Q7:

Find correlation between all numeric columns using NumPy (not pandas built-in only).

Explain:

Which two features are most correlated?

Why might that be misleading?

In [24]:
# Collect Numeric Columns:
numeric_df = df.select_dtypes(include=[np.number])
pd.DataFrame(numeric_df)

,PassengerId,Pclass,Age,SibSp,Parch,FamilySize,isAlone,Fare
0,892,3,34.50000,0,0,1,1,7.8292
1,893,3,47.00000,1,0,2,0,7.0000
2,894,2,62.00000,0,0,1,1,9.6875
3,895,3,27.00000,0,0,1,1,8.6625
4,896,3,22.00000,1,1,3,0,12.2875
...,...,...,...,...,...,...,...,...
413,1305,3,30.27259,0,0,1,1,8.0500
414,1306,1,39.00000,0,0,1,1,108.9000
415,1307,3,38.50000,0,0,1,1,7.2500
416,1308,3,30.27259,0,0,1,1,8.0500
417,1309,3,30.27259,1,1,3,0,22.3583

In [27]:
# Convert to Np Array:
df_nparr = numeric_df.to_numpy()
print(df_nparr[0])

[892.       3.      34.5      0.       0.       1.       1.       7.8292]

In [38]:
# Find Correalation:
corr_matrix = np.corrcoef(df_nparr, rowvar=False)
pd.DataFrame(corr_matrix)

,0,1,2,3,4,5,6,7
0,1.000000,-0.026751,-0.030874,0.003818,0.043080,0.030087,-0.000629,0.008209
1,-0.026751,1.000000,-0.440782,0.001087,0.018721,0.012736,0.173555,-0.576619
2,-0.030874,-0.440782,1.000000,-0.079535,-0.045073,-0.076072,-0.021604,0.326800
3,0.003818,0.001087,-0.079535,1.000000,0.306895,0.788610,-0.618483,0.171488
4,0.043080,0.018721,-0.045073,0.306895,1.000000,0.827242,-0.495618,0.230001
5,0.030087,0.012736,-0.076072,0.788610,0.827242,1.000000,-0.685316,0.249832
6,-0.000629,0.173555,-0.021604,-0.618483,-0.495618,-0.685316,1.000000,-0.282270
7,0.008209,-0.576619,0.326800,0.171488,0.230001,0.249832,-0.282270,1.000000

In [40]:
np.fill_diagonal(corr_matrix, 0)
pd.DataFrame(corr_matrix)

,0,1,2,3,4,5,6,7
0,0.000000,-0.026751,-0.030874,0.003818,0.043080,0.030087,-0.000629,0.008209
1,-0.026751,0.000000,-0.440782,0.001087,0.018721,0.012736,0.173555,-0.576619
2,-0.030874,-0.440782,0.000000,-0.079535,-0.045073,-0.076072,-0.021604,0.326800
3,0.003818,0.001087,-0.079535,0.000000,0.306895,0.788610,-0.618483,0.171488
4,0.043080,0.018721,-0.045073,0.306895,0.000000,0.827242,-0.495618,0.230001
5,0.030087,0.012736,-0.076072,0.788610,0.827242,0.000000,-0.685316,0.249832
6,-0.000629,0.173555,-0.021604,-0.618483,-0.495618,-0.685316,0.000000,-0.282270
7,0.008209,-0.576619,0.326800,0.171488,0.230001,0.249832,-0.282270,0.000000